name: "dummy_transformer_52c16d0957c62493"
platform: "onnxruntime_onnx"
max_batch_size: 10
instance_group {
  count: 1
  kind: KIND_CPU
}
dynamic_batching {
  max_queue_delay_microseconds: 100000
}
parameters {
  key: "enable_mem_area"
  value {
    string_value: "0"
  }
}
parameters {
  key: "enable_mem_pattern"
  value {
    string_value: "0"
  }
}
parameters {
  key: "inter_op_thread_count"
  value {
    string_value: "2"
  }
}
parameters {
  key: "intra_op_thread_count"
  value {
    string_value: "8"
  }
}
